[
  {
    "title": "Badr Interactive",
    "image": "/images/careers/Badr.png",
    "date": "June 2024 - Present",
    "description": "At Badr, I joined the Malawi team to manage the Smile Malawi, which was designed for use in Malawi. After successfully completing the Smile Malawi project, I transitioned to the Platform team, where I worked on developing Smile Platform, a platform designed to organize and integrate the various features of Smile Web into one cohesive system. This experience has allowed me to contribute to impactful projects while gaining valuable insights into platform development and management."
  },
  {
    "title": "Shipper",
    "image": "/images/careers/Shipper.png",
    "date": "July 2024 - November 2023",
    "description": "At Shipper, embarked on an enriching journey within the shipping team, where I diligently managed the processing of shipment orders, catering to the needs of our esteemed agents and merchants. Through this role, I gained invaluable insights into the intricate logistics and operations of the shipping industry, contributing to the seamless flow of goods and services."
  },
  {
    "title": "CV. Ergossum",
    "image": "/images/careers/default.svg",
    "date": "August 2020 - May 2021",
    "description": "an my professional journey as a freelancer, later transitioning into a contracted role directly under the ownership. Throughout this tenure, I successfully managed a diverse array of projects spanning from UI/UX design to comprehensive end-to-end testing. This multifaceted experience not only honed my skills across various domains but also provided me with invaluable insights into project management and client collaboration, contributing to my holistic growth as a professional."
  },
  {
    "title": "Esteh Creative (Internship)",
    "image": "/images/careers/Esteh.png",
    "date": "February 2020 - July 2020",
    "description": "As an intern at this esteemed company, I underwent a transformative learning experience. I gained hands-on expertise in creating and enhancing websites using ReactJS, delved into the intricacies of end-to-end testing, and gained valuable insights into the entire development lifecycle. This immersive journey equipped me with invaluable skills and knowledge, paving the way for my professional growth in the field of web development."
  }
]
