[
  {
    "title": "Shipper 360",
    "stack": ["next", "stitches", "graphql", "axios"],
    "image": "/images/portfolios/Shipper 360.jpg",
    "url": "https://360.shipper.id/login",
    "description": "Shipper360 provides a range of services for merchants, including shipping, fulfillment, warehousing, omnichannel solutions, and a wallet for payment management.",
    "contribution": [
      "Spearheaded the design and implementation of comprehensive shipping, fulfillment, and warehousing solutions tailored to the specific needs of merchants.",
      "Led the development of innovative omnichannel strategies to streamline the customer experience and drive sales growth across multiple channels.",
      "Orchestrated the integration of Shipper360's wallet system into the payment management infrastructure, ensuring seamless and secure transactions for merchants.",
      "Collaborated closely with cross-functional teams to align technology solutions with business objectives and drive continuous improvement initiatives.",
      "Acted as a strategic advisor to merchants, providing insights and recommendations on leveraging Shipper360's services to optimize operations and achieve their business goals."
    ]
  },
  {
    "title": "Shipper Dashboard",
    "stack": ["next", "styled-jsx", "graphql", "axios"],
    "image": "/images/portfolios/Shipper BOS.jpg",
    "url": "https://dashboard.shipper.id/login",
    "description": "Shipper Dashboard facilitates domestic and international shipping for merchants, alongside a wallet for order payments and commission disbursements.",
    "contribution": [
      "Played a pivotal role in the development and maintenance of Shipper Dashboard, a robust platform enabling merchants to manage domestic and international shipping seamlessly.",
      "Led the implementation of key features within the dashboard, focusing on enhancing user experience, scalability, and performance.",
      "Engineered the integration of a wallet system into the dashboard, allowing merchants to conveniently handle order payments and commission disbursements.",
      "Collaborated closely with product managers, designers, and fellow engineers to translate business requirements into technical solutions, ensuring alignment with Shipper's goals and objectives.",
      "Conducted code reviews, provided technical guidance, and contributed to the continuous improvement of development processes and best practices within the team."
    ]
  },
  {
    "title": "Shipper HQ",
    "stack": ["react", "sass", "graphql", "axios"],
    "image": "/images/portfolios/Shipper HQ.jpg",
    "url": "https://mitra.shipper.id/#/login",
    "description": "ShipperHQ aids agents in processing domestic and international orders for merchants and non-merchants. It includes a wallet for order payments and commission disbursement.",
    "contribution": [
      "Led the frontend development efforts, focusing on crafting an intuitive and visually captivating user interface for the project.",
      "Implemented a variety of features aimed at enhancing user engagement, including personalized learning paths and interactive exercises, to create a dynamic and immersive learning experience.",
      "Worked closely with the backend team to establish clear communication and ensure seamless integration of frontend components with the backend infrastructure.",
      "Leveraged expertise in frontend technologies and best practices to optimize performance, usability, and accessibility of the application.",
      "Actively participated in design discussions, provided valuable insights, and collaborated with cross-functional teams to deliver high-quality solutions that met project requirements and exceeded user expectations."
    ]
  },
  {
    "title": "AvidX - Profile",
    "stack": ["html", "tailwind", "javascript"],
    "image": "/images/portfolios/AvidX - Profile.jpg",
    "url": "https://www.avidx.app/index.html",
    "description": "AvidX is an immersive English practice for all levels. Passionately crafted to enhance stack skills through engaging methods.",
    "contribution": [
      "Created an intuitive and visually appealing user interface.",
      "Implemented features to enhance user engagement, including personalized learning paths and interactive exercises.",
      "Collaborated with the backend team to ensure seamless integration of frontend components."
    ]
  },
  {
    "title": "AvidX - Practice",
    "stack": ["react", "styled-components", "polished", "axios", "react-query"],
    "image": "/images/portfolios/AvidX - Practice.jpg",
    "url": "https://practice.avidx.app/login",
    "description": "AvidX Practice elevates English skills through focused reading, writing, listening, and speaking sessions. Enjoy free access to these beneficial sessions.",
    "contribution": [
      "Implemented interactive exercises to enhance user engagement.",
      "Developed the speaking challenges feature to facilitate language practice.",
      "Ensured a visually appealing and user-friendly interface for optimal user experience.",
      "Aimed to create an online space where users could genuinely enjoy practicing English and observe tangible progress in their language skills."
    ]
  },
  {
    "title": "Vita School",
    "stack": ["html", "bootstrap", "javascript", "laravel"],
    "image": "/images/portfolios/Vita School.jpg",
    "url": "https://vitaschool.sch.id/",
    "description": "Vita School's dynamic web profile highlights the institution's essence, serving students, parents, and the community with cultural insights and event updates.",
    "contribution": [
      "Translated design concepts into a visually appealing and user-friendly interface.",
      "Collaborated closely with the design team to ensure seamless integration of design elements.",
      "Worked closely with the backend team to ensure the functionality of the frontend interface.",
      "Contributed to creating a cohesive and impactful digital presence for Vita School."
    ]
  },
  {
    "title": "Citiplan Indonesia",
    "stack": ["html", "bootstrap", "javascript", "slick-slider"],
    "image": "/images/portfolios/Citiplan Indonesia.jpg",
    "url": "https://citiplanindonesia.com",
    "description": "Citiplan Indonesia's web profile showcases achievements, services, and commitment to excellence, reflecting company values.",
    "contribution": [
      "Created an inviting and user-friendly interface for the website.",
      "Collaborated closely with the design team to implement visually appealing design elements.",
      "Worked closely with the content team to ensure effective communication of Citiplan's values, achievements, and services through the website."
    ]
  },
  {
    "title": "Artpedia",
    "stack": ["html", "sass", "javascript"],
    "image": "/images/portfolios/Artpedia.jpg",
    "url": "https://arathfal.github.io/artpedia/",
    "description": "Your go-to for art info! Explore diverse art forms, techniques, and cultural movements. Perfect for enthusiasts, students, and the curious.",
    "contribution": [
      "Created an inviting and user-friendly interface for the website",
      "Collaborated closely with the design team to implement visually appealing design elements",
      "Developed original content to effectively communicate Citiplan's values, achievements, and services through the website"
    ]
  },
  {
    "title": "Froyanesia",
    "stack": ["html", "bootstrap", "javascript", "laravel"],
    "image": "/images/portfolios/Froya.jpg",
    "url": "http://froya.co.id",
    "disabled": true,
    "description": "Froyanesia stands as a pioneering digital marketplace tailored for the buying and selling of fresh chicken, providing a convenient and reliable platform for enthusiasts of fresh chicken."
  },
  {
    "title": "Esusmart",
    "stack": ["html", "bootstrap", "javascript", "laravel"],
    "image": "/images/portfolios/Esusmart.png",
    "url": "http://esusmart.com",
    "disabled": true,
    "description": "Esusmart represents a groundbreaking venture into the digital realm of neighborhood convenience, serving as a dedicated online marketplace for the modern \"kelontong\" or mini mart. This web platform redefines the traditional shopping experience by bringing the corner store to the fingertips of users, offering a diverse range of everyday essentials in a seamless and user-friendly digital environment."
  },
  {
    "title": "Bimi",
    "stack": ["html", "bootstrap", "javascript"],
    "image": "/images/portfolios/Bimi.jpg",
    "url": "http://bmi.esusmart.com",
    "disabled": true,
    "description": "Bimi is a web profile project stands as a digital gateway to the world of Bimi, a distinguished mining company. This online platform provides a comprehensive overview of Bimi's operations, values, and contributions to the mining industry. Through thoughtful design and informative content, the web profile showcases Bimi's commitment to excellence in the field of mining"
  },
  {
    "title": "Doolen",
    "stack": ["html", "bootstrap", "javascript"],
    "image": "/images/portfolios/Doolen.jpg",
    "url": "https://doolen.com/",
    "disabled": true,
    "description": "Doolen emerges as a cutting-edge online marketplace designed to revolutionize the way we buy and sell fresh produce, fruits, seafood, and daily essentials. Serving as a digital marketplace for everyday needs, Doolen connects consumers with a diverse range of high-quality, locally sourced products, offering a seamless and convenient solution for modern-day grocery shopping."
  }
]
